InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/HIB/HIB_Peripheral/HIB_Register.h
/*
 * HIB_Register.h
 *
 *  Created on: 17 jun. 2020
 *      Author: vyldram
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_HIB_HIB_PERIPHERAL_HIB_REGISTER_H_
#define XDRIVER_MCU_DRIVER_HEADER_HIB_HIB_PERIPHERAL_HIB_REGISTER_H_

#include <xDriver_MCU/Driver_Header/HIB/HIB_Peripheral/HIB_Struct.h>

#define HIB_BASE            ((uint32_t)0x400FC000u)
#define HIB_BITBANDING_BASE ((uint32_t)0x42000000u)
#define HIB_OFFSET          ((uint32_t)0x000FC000u)


#define HIB                 (((HIB_TypeDef*)(HIB_BASE)))
#define HIB_BITBANDING      (((HIB_BITBANDING_TypeDef*)(HIB_BITBANDING_BASE+(HIB_OFFSET*32u))))


#define HIB_HIBRTCC_OFFSET     ((uint32_t)0x0000u)
#define HIB_HIBRTCM0_OFFSET    ((uint32_t)0x0004u)
#define HIB_HIBRTCLD_OFFSET    ((uint32_t)0x000Cu)
#define HIB_HIBCTL_OFFSET      ((uint32_t)0x0010u)
#define HIB_HIBIM_OFFSET       ((uint32_t)0x0014u)
#define HIB_HIBRIS_OFFSET      ((uint32_t)0x0018u)
#define HIB_HIBMIS_OFFSET      ((uint32_t)0x001Cu)
#define HIB_HIBIC_OFFSET       ((uint32_t)0x0020u)
#define HIB_HIBRTCT_OFFSET     ((uint32_t)0x0024u)
#define HIB_HIBRTCSS_OFFSET    ((uint32_t)0x0028u)
#define HIB_HIBDATA_OFFSET     ((uint32_t)0x0030u)
#define HIB_HIBDATA0_OFFSET    ((uint32_t)0x0030u)
#define HIB_HIBDATA1_OFFSET    ((uint32_t)0x0034u)
#define HIB_HIBDATA2_OFFSET    ((uint32_t)0x0038u)
#define HIB_HIBDATA3_OFFSET    ((uint32_t)0x003Cu)
#define HIB_HIBDATA4_OFFSET    ((uint32_t)0x0040u)
#define HIB_HIBDATA5_OFFSET    ((uint32_t)0x0044u)
#define HIB_HIBDATA6_OFFSET    ((uint32_t)0x0048u)
#define HIB_HIBDATA7_OFFSET    ((uint32_t)0x004Cu)
#define HIB_HIBDATA8_OFFSET    ((uint32_t)0x0050u)
#define HIB_HIBDATA9_OFFSET    ((uint32_t)0x0054u)
#define HIB_HIBDATA10_OFFSET   ((uint32_t)0x0058u)
#define HIB_HIBDATA11_OFFSET   ((uint32_t)0x005Cu)
#define HIB_HIBDATA12_OFFSET   ((uint32_t)0x0060u)
#define HIB_HIBDATA13_OFFSET   ((uint32_t)0x0064u)
#define HIB_HIBDATA14_OFFSET   ((uint32_t)0x0068u)
#define HIB_HIBDATA15_OFFSET   ((uint32_t)0x006Cu)

/******************************************************************************************
************************************ 1 HIBRTCC *********************************************
******************************************************************************************/
#define HIB_HIBRTCC            (((HIBRTCC_TypeDef*)(HIB_BASE+HIB_HIBRTCC_OFFSET )))
#define HIB_HIBRTCC_R          (*((volatile const uint32_t *)(HIB_BASE+HIB_HIBRTCC_OFFSET)))
#define HIB_BITBANDING_HIBRTCC      (((BITBANDING_HIBRTCC_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRTCC_OFFSET)*32u))))


/*----------*/
#define HIB_HIBRTCC_R_RTCC_MASK     ((uint32_t)0xFFFFFFFFu)
#define HIB_HIBRTCC_R_RTCC_BIT      (0u)

#define HIB_HIBRTCC_RTCC_MASK       ((uint32_t)0xFFFFFFFFu)
/*----------*/

/******************************************************************************************
************************************ 2 HIBRTCM0 *********************************************
******************************************************************************************/

#define HIB_HIBRTCM0            (((HIBRTCM0_TypeDef*)(HIB_BASE+HIB_HIBRTCM0_OFFSET )))
#define HIB_HIBRTCM0_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBRTCM0_OFFSET)))
#define HIB_BITBANDING_HIBRTCM0      (((BITBANDING_HIBRTCM0_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRTCM0_OFFSET)*32u))))

/*----------*/
#define HIB_HIBRTCM0_R_RTCM0_MASK     ((uint32_t)0xFFFFFFFFu)
#define HIB_HIBRTCM0_R_RTCM0_BIT      (0u)

#define HIB_HIBRTCM0_RTCM0_MASK       ((uint32_t)0xFFFFFFFFu)
/*----------*/

/******************************************************************************************
************************************ 3 HIBRTCLD *********************************************
******************************************************************************************/

#define HIB_HIBRTCLD            (((HIBRTCLD_TypeDef*)(HIB_BASE+HIB_HIBRTCLD_OFFSET )))
#define HIB_HIBRTCLD_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBRTCLD_OFFSET)))
#define HIB_BITBANDING_HIBRTCLD      (((BITBANDING_HIBRTCLD_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRTCLD_OFFSET)*32u))))

/*----------*/
#define HIB_HIBRTCLD_R_RTCLD_MASK     ((uint32_t)0xFFFFFFFFu)
#define HIB_HIBRTCLD_R_RTCLD_BIT      (0u)

#define HIB_HIBRTCLD_RTCLD_MASK       ((uint32_t)0xFFFFFFFFu)
/*----------*/

/******************************************************************************************
************************************ 4 HIBCTL *********************************************
******************************************************************************************/

#define HIB_HIBCTL            (((HIBCTL_TypeDef*)(HIB_BASE+HIB_HIBCTL_OFFSET )))
#define HIB_HIBCTL_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBCTL_OFFSET)))
#define HIB_BITBANDING_HIBCTL      (((BITBANDING_HIBCTL_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u))))


/*----------*/
#define HIB_HIBCTL_R_RTCEN_MASK     ((uint32_t)0x00000001u)
#define HIB_HIBCTL_R_RTCEN_BIT      (0u)
#define HIB_HIBCTL_R_RTCEN_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_RTCEN_EN       ((uint32_t)0x00000001u)

#define HIB_HIBCTL_RTCEN_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_RTCEN_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_RTCEN_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_HIBREQ_MASK     ((uint32_t)0x00000002u)
#define HIB_HIBCTL_R_HIBREQ_BIT      (1u)
#define HIB_HIBCTL_R_HIBREQ_NOREQ    ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_HIBREQ_INIT     ((uint32_t)0x00000002u)

#define HIB_HIBCTL_HIBREQ_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_HIBREQ_NOREQ      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_HIBREQ_INIT       ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_RTCWEN_MASK     ((uint32_t)0x00000008u)
#define HIB_HIBCTL_R_RTCWEN_BIT      (3u)
#define HIB_HIBCTL_R_RTCWEN_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_RTCWEN_EN       ((uint32_t)0x00000008u)

#define HIB_HIBCTL_RTCWEN_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_RTCWEN_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_RTCWEN_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_PINWEN_MASK     ((uint32_t)0x00000010u)
#define HIB_HIBCTL_R_PINWEN_BIT      (4u)
#define HIB_HIBCTL_R_PINWEN_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_PINWEN_EN       ((uint32_t)0x00000010u)

#define HIB_HIBCTL_PINWEN_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_PINWEN_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_PINWEN_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_CLK32EN_MASK     ((uint32_t)0x00000040u)
#define HIB_HIBCTL_R_CLK32EN_BIT      (6u)
#define HIB_HIBCTL_R_CLK32EN_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_CLK32EN_EN       ((uint32_t)0x00000040u)

#define HIB_HIBCTL_CLK32EN_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_CLK32EN_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_CLK32EN_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_VABORT_MASK     ((uint32_t)0x00000080u)
#define HIB_HIBCTL_R_VABORT_BIT      (7u)
#define HIB_HIBCTL_R_VABORT_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_VABORT_EN       ((uint32_t)0x00000080u)

#define HIB_HIBCTL_VABORT_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_VABORT_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_VABORT_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_VDD3ON_MASK     ((uint32_t)0x00000100u)
#define HIB_HIBCTL_R_VDD3ON_BIT      (8u)
#define HIB_HIBCTL_R_VDD3ON_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_VDD3ON_EN       ((uint32_t)0x00000100u)

#define HIB_HIBCTL_VDD3ON_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_VDD3ON_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_VDD3ON_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_BATWKEN_MASK     ((uint32_t)0x00000200u)
#define HIB_HIBCTL_R_BATWKEN_BIT      (9u)
#define HIB_HIBCTL_R_BATWKEN_DIS      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_BATWKEN_EN       ((uint32_t)0x00000200u)

