InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/HIB/HIB_Peripheral/HIB_Register.h
#define HIB_HIBCTL_BATWKEN_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_BATWKEN_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBCTL_BATWKEN_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_BATCHK_MASK       ((uint32_t)0x00000400u)
#define HIB_HIBCTL_R_BATCHK_BIT        (10u)
#define HIB_HIBCTL_R_BATCHK_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_BATCHK_NOCOMPLETE ((uint32_t)0x00000400u)
#define HIB_HIBCTL_R_BATCHK_INIT       ((uint32_t)0x00000400u)

#define HIB_HIBCTL_BATCHK_MASK        ((uint32_t)0x00000001u)
#define HIB_HIBCTL_BATCHK_NOACTIVE    ((uint32_t)0x00000000u)
#define HIB_HIBCTL_BATCHK_NOCOMPLETE  ((uint32_t)0x00000001u)
#define HIB_HIBCTL_BATCHK_INIT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_VBATSEL_MASK       ((uint32_t)0x00006000u)
#define HIB_HIBCTL_R_VBATSEL_BIT        (13u)
#define HIB_HIBCTL_R_VBATSEL_1900mV     ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_VBATSEL_2100mV     ((uint32_t)0x00002000u)
#define HIB_HIBCTL_R_VBATSEL_2300mV     ((uint32_t)0x00004000u)
#define HIB_HIBCTL_R_VBATSEL_2500mV     ((uint32_t)0x00006000u)

#define HIB_HIBCTL_VBATSEL_MASK        ((uint32_t)0x00000003u)
#define HIB_HIBCTL_VBATSEL_1900mV      ((uint32_t)0x00000000u)
#define HIB_HIBCTL_VBATSEL_2100mV      ((uint32_t)0x00000001u)
#define HIB_HIBCTL_VBATSEL_2300mV      ((uint32_t)0x00000002u)
#define HIB_HIBCTL_VBATSEL_2500mV      ((uint32_t)0x00000003u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_OSCBYP_MASK     ((uint32_t)0x00010000u)
#define HIB_HIBCTL_R_OSCBYP_BIT      (16u)
#define HIB_HIBCTL_R_OSCBYP_EN       ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_OSCBYP_DIS      ((uint32_t)0x00010000u)

#define HIB_HIBCTL_OSCBYP_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_OSCBYP_EN         ((uint32_t)0x00000000u)
#define HIB_HIBCTL_OSCBYP_DIS        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_OSCDRV_MASK     ((uint32_t)0x00020000u)
#define HIB_HIBCTL_R_OSCDRV_BIT      (17u)
#define HIB_HIBCTL_R_OSCDRV_12pF     ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_OSCDRV_24pF     ((uint32_t)0x00020000u)

#define HIB_HIBCTL_OSCDRV_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_OSCDRV_12pF       ((uint32_t)0x00000000u)
#define HIB_HIBCTL_OSCDRV_24pF       ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBCTL_R_WRC_MASK     ((uint32_t)0x80000000u)
#define HIB_HIBCTL_R_WRC_BIT      (31u)
#define HIB_HIBCTL_R_WRC_BUSY     ((uint32_t)0x00000000u)
#define HIB_HIBCTL_R_WRC_RDY      ((uint32_t)0x80000000u)

#define HIB_HIBCTL_WRC_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBCTL_WRC_BUSY       ((uint32_t)0x00000000u)
#define HIB_HIBCTL_WRC_RDY        ((uint32_t)0x00000001u)
/*----------*/


#define HIB_BITBANDING_HIBCTL_RTCEN   (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_RTCEN_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_HIBREQ  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_HIBREQ_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_RTCWEN  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_RTCWEN_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_PINWEN  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_PINWEN_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_CLK32EN (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_CLK32EN_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_VABORT  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_VABORT_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_VDD3ON  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_VDD3ON_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_BATWKEN (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_BATWKEN_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_BATCHK  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_BATCHK_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_OSCBYP  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_OSCBYP_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_OSCDRV  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_OSCDRV_BIT*4u))))
#define HIB_BITBANDING_HIBCTL_WRC     (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBCTL_OFFSET)*32u)+(HIB_HIBCTL_R_WRC_BIT*4u))))

/******************************************************************************************
************************************ 5 HIBIM *********************************************
******************************************************************************************/

#define HIB_HIBIM            (((HIBIM_TypeDef*)(HIB_BASE+HIB_HIBIM_OFFSET )))
#define HIB_HIBIM_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBIM_OFFSET)))
#define HIB_BITBANDING_HIBIM      (((BITBANDING_HIBIM_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIM_OFFSET)*32u))))


/*----------*/
#define HIB_HIBIM_R_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIM_R_RTCALT0_BIT        (0u)
#define HIB_HIBIM_R_RTCALT0_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_R_RTCALT0_EN         ((uint32_t)0x00000001u)

#define HIB_HIBIM_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIM_RTCALT0_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_RTCALT0_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIM_R_LOWBAT_MASK       ((uint32_t)0x00000004u)
#define HIB_HIBIM_R_LOWBAT_BIT        (2u)
#define HIB_HIBIM_R_LOWBAT_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_R_LOWBAT_EN         ((uint32_t)0x00000004u)

#define HIB_HIBIM_LOWBAT_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIM_LOWBAT_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_LOWBAT_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIM_R_EXTW_MASK       ((uint32_t)0x00000008u)
#define HIB_HIBIM_R_EXTW_BIT        (3u)
#define HIB_HIBIM_R_EXTW_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_R_EXTW_EN         ((uint32_t)0x00000008u)

#define HIB_HIBIM_EXTW_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIM_EXTW_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_EXTW_EN         ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIM_R_WC_MASK       ((uint32_t)0x00000010u)
#define HIB_HIBIM_R_WC_BIT        (4u)
#define HIB_HIBIM_R_WC_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_R_WC_EN         ((uint32_t)0x00000010u)

#define HIB_HIBIM_WC_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIM_WC_DIS        ((uint32_t)0x00000000u)
#define HIB_HIBIM_WC_EN         ((uint32_t)0x00000001u)
/*----------*/

#define HIB_BITBANDING_HIBIM_RTCALT0 (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIM_OFFSET)*32u)+(HIB_HIBIM_R_RTCALT0_BIT*4u))))
#define HIB_BITBANDING_HIBIM_LOWBAT  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIM_OFFSET)*32u)+(HIB_HIBIM_R_LOWBAT_BIT*4u))))
#define HIB_BITBANDING_HIBIM_EXTW    (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIM_OFFSET)*32u)+(HIB_HIBIM_R_EXTW_BIT*4u))))
#define HIB_BITBANDING_HIBIM_WC      (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIM_OFFSET)*32u)+(HIB_HIBIM_R_WC_BIT*4u))))

/******************************************************************************************
************************************ 6 HIBRIS *********************************************
******************************************************************************************/


#define HIB_HIBRIS            (((HIBRIS_TypeDef*)(HIB_BASE+HIB_HIBRIS_OFFSET )))
#define HIB_HIBRIS_R          (*((volatile const uint32_t *)(HIB_BASE+HIB_HIBRIS_OFFSET)))
#define HIB_BITBANDING_HIBRIS      (((BITBANDING_HIBRIS_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRIS_OFFSET)*32u))))


/*----------*/
#define HIB_HIBRIS_R_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBRIS_R_RTCALT0_BIT        (0u)
#define HIB_HIBRIS_R_RTCALT0_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_R_RTCALT0_ACTIVE     ((uint32_t)0x00000001u)

#define HIB_HIBRIS_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBRIS_RTCALT0_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_RTCALT0_ACTIVE     ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBRIS_R_LOWBAT_MASK       ((uint32_t)0x00000004u)
#define HIB_HIBRIS_R_LOWBAT_BIT        (2u)
#define HIB_HIBRIS_R_LOWBAT_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_R_LOWBAT_ACTIVE     ((uint32_t)0x00000004u)

#define HIB_HIBRIS_LOWBAT_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBRIS_LOWBAT_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_LOWBAT_ACTIVE     ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBRIS_R_EXTW_MASK       ((uint32_t)0x00000008u)
#define HIB_HIBRIS_R_EXTW_BIT        (3u)
#define HIB_HIBRIS_R_EXTW_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_R_EXTW_ACTIVE     ((uint32_t)0x00000008u)

#define HIB_HIBRIS_EXTW_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBRIS_EXTW_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_EXTW_ACTIVE     ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBRIS_R_WC_MASK       ((uint32_t)0x00000010u)
#define HIB_HIBRIS_R_WC_BIT        (4u)
#define HIB_HIBRIS_R_WC_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_R_WC_ACTIVE     ((uint32_t)0x00000010u)

#define HIB_HIBRIS_WC_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBRIS_WC_NOACTIVE   ((uint32_t)0x00000000u)
#define HIB_HIBRIS_WC_ACTIVE     ((uint32_t)0x00000001u)
/*----------*/


#define HIB_BITBANDING_HIBRIS_RTCALT0 (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRIS_OFFSET)*32u)+(HIB_HIBRIS_R_RTCALT0_BIT*4u))))
#define HIB_BITBANDING_HIBRIS_LOWBAT  (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRIS_OFFSET)*32u)+(HIB_HIBRIS_R_LOWBAT_BIT*4u))))
#define HIB_BITBANDING_HIBRIS_EXTW    (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRIS_OFFSET)*32u)+(HIB_HIBRIS_R_EXTW_BIT*4u))))
#define HIB_BITBANDING_HIBRIS_WC      (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRIS_OFFSET)*32u)+(HIB_HIBRIS_R_WC_BIT*4u))))

/******************************************************************************************
************************************ 7 HIBMIS *********************************************
******************************************************************************************/

#define HIB_HIBMIS            (((HIBMIS_TypeDef*)(HIB_BASE+HIB_HIBMIS_OFFSET )))
#define HIB_HIBMIS_R          (*((volatile const uint32_t *)(HIB_BASE+HIB_HIBMIS_OFFSET)))
#define HIB_BITBANDING_HIBMIS      (((BITBANDING_HIBMIS_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBMIS_OFFSET)*32u))))


/*----------*/
#define HIB_HIBMIS_R_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBMIS_R_RTCALT0_BIT        (0u)
#define HIB_HIBMIS_R_RTCALT0_NOOCCUR   ((uint32_t)0x00000000u)
#define HIB_HIBMIS_R_RTCALT0_OCCUR     ((uint32_t)0x00000001u)

#define HIB_HIBMIS_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBMIS_RTCALT0_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_RTCALT0_OCCUR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBMIS_R_LOWBAT_MASK       ((uint32_t)0x00000004u)
#define HIB_HIBMIS_R_LOWBAT_BIT        (2u)
#define HIB_HIBMIS_R_LOWBAT_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_R_LOWBAT_OCCUR      ((uint32_t)0x00000004u)

#define HIB_HIBMIS_LOWBAT_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBMIS_LOWBAT_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_LOWBAT_OCCUR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBMIS_R_EXTW_MASK       ((uint32_t)0x00000008u)
#define HIB_HIBMIS_R_EXTW_BIT        (3u)
#define HIB_HIBMIS_R_EXTW_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_R_EXTW_OCCUR      ((uint32_t)0x00000008u)

