InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/HIB/HIB_Peripheral/HIB_Register.h
#define HIB_HIBMIS_EXTW_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBMIS_EXTW_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_EXTW_OCCUR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBMIS_R_WC_MASK       ((uint32_t)0x00000010u)
#define HIB_HIBMIS_R_WC_BIT        (4u)
#define HIB_HIBMIS_R_WC_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_R_WC_OCCUR      ((uint32_t)0x00000010u)

#define HIB_HIBMIS_WC_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBMIS_WC_NOOCCUR    ((uint32_t)0x00000000u)
#define HIB_HIBMIS_WC_OCCUR      ((uint32_t)0x00000001u)
/*----------*/

#define HIB_BITBANDING_HIBMIS_RTCALT0 (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBMIS_OFFSET)*32u)+(HIB_HIBMIS_R_RTCALT0_BIT*4u))))
#define HIB_BITBANDING_HIBMIS_LOWBAT  (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBMIS_OFFSET)*32u)+(HIB_HIBMIS_R_LOWBAT_BIT*4u))))
#define HIB_BITBANDING_HIBMIS_EXTW    (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBMIS_OFFSET)*32u)+(HIB_HIBMIS_R_EXTW_BIT*4u))))
#define HIB_BITBANDING_HIBMIS_WC      (*((volatile const uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBMIS_OFFSET)*32u)+(HIB_HIBMIS_R_WC_BIT*4u))))

/******************************************************************************************
************************************ 8 HIBIC *********************************************
******************************************************************************************/

#define HIB_HIBIC            (((HIBIC_TypeDef*)(HIB_BASE+HIB_HIBIC_OFFSET )))
#define HIB_HIBIC_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBIC_OFFSET)))
#define HIB_BITBANDING_HIBIC      (((BITBANDING_HIBIC_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIC_OFFSET)*32u))))

/*----------*/
#define HIB_HIBIC_R_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIC_R_RTCALT0_BIT        (0u)
#define HIB_HIBIC_R_RTCALT0_CLEAR      ((uint32_t)0x00000001u)

#define HIB_HIBIC_RTCALT0_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIC_RTCALT0_CLEAR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIC_R_LOWBAT_MASK       ((uint32_t)0x00000004u)
#define HIB_HIBIC_R_LOWBAT_BIT        (2u)
#define HIB_HIBIC_R_LOWBAT_CLEAR      ((uint32_t)0x00000004u)

#define HIB_HIBIC_LOWBAT_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIC_LOWBAT_CLEAR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIC_R_EXTW_MASK       ((uint32_t)0x00000008u)
#define HIB_HIBIC_R_EXTW_BIT        (3u)
#define HIB_HIBIC_R_EXTW_CLEAR      ((uint32_t)0x00000008u)

#define HIB_HIBIC_EXTW_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIC_EXTW_CLEAR      ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define HIB_HIBIC_R_WC_MASK       ((uint32_t)0x00000010u)
#define HIB_HIBIC_R_WC_BIT        (4u)
#define HIB_HIBIC_R_WC_CLEAR      ((uint32_t)0x00000010u)

#define HIB_HIBIC_WC_MASK       ((uint32_t)0x00000001u)
#define HIB_HIBIC_WC_CLEAR      ((uint32_t)0x00000001u)
/*----------*/

#define HIB_BITBANDING_HIBIC_RTCALT0 (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIC_OFFSET)*32u)+(HIB_HIBIC_R_RTCALT0_BIT*4u))))
#define HIB_BITBANDING_HIBIC_LOWBAT  (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIC_OFFSET)*32u)+(HIB_HIBIC_R_LOWBAT_BIT*4u))))
#define HIB_BITBANDING_HIBIC_EXTW    (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIC_OFFSET)*32u)+(HIB_HIBIC_R_EXTW_BIT*4u))))
#define HIB_BITBANDING_HIBIC_WC      (*((volatile uint32_t *)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBIC_OFFSET)*32u)+(HIB_HIBIC_R_WC_BIT*4u))))

/******************************************************************************************
************************************ 9 HIBRTCT *********************************************
******************************************************************************************/

#define HIB_HIBRTCT            (((HIBRTCT_TypeDef*)(HIB_BASE+HIB_HIBRTCT_OFFSET )))
#define HIB_HIBRTCT_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBRTCT_OFFSET)))
#define HIB_BITBANDING_HIBRTCT      (((BITBANDING_HIBRTCT_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRTCT_OFFSET)*32u))))

/*----------*/
#define HIB_HIBRTCT_R_TRIM_MASK     ((uint32_t)0x0000FFFFu)
#define HIB_HIBRTCT_R_TRIM_BIT      (0u)

#define HIB_HIBRTCT_TRIM_MASK       ((uint32_t)0x0000FFFFu)
/*----------*/

/******************************************************************************************
************************************ 10 HIBRTCSS *********************************************
******************************************************************************************/

#define HIB_HIBRTCSS            (((HIBRTCSS_TypeDef*)(HIB_BASE+HIB_HIBRTCSS_OFFSET )))
#define HIB_HIBRTCSS_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBRTCSS_OFFSET)))
#define HIB_BITBANDING_HIBRTCSS      (((BITBANDING_HIBRTCSS_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBRTCSS_OFFSET)*32u))))

/*----------*/
#define HIB_HIBRTCSS_R_RTCSSC_MASK     ((uint32_t)0x00007FFFu)
#define HIB_HIBRTCSS_R_RTCSSC_BIT      (0u)

#define HIB_HIBRTCSS_RTCSSC_MASK       ((uint32_t)0x00007FFFu)
/*----------*/

/*----------*/
#define HIB_HIBRTCSS_R_RTCSSM_MASK     ((uint32_t)0x7FFF0000u)
#define HIB_HIBRTCSS_R_RTCSSM_BIT      (16u)

#define HIB_HIBRTCSS_RTCSSM_MASK       ((uint32_t)0x00007FFFu)
/*----------*/


/******************************************************************************************
************************************ HIBDATA *********************************************
******************************************************************************************/

#define HIB_HIBDATA            (((HIBDATA_ARRAY_TypeDef*)(HIB_BASE+HIB_HIBDATA_OFFSET )))
#define HIB_BITBANDING_HIBDATA      (((BITBANDING_HIBDATA_ARRAY_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA_OFFSET)*32u))))



/******************************************************************************************
************************************ 11 HIBDATA0 *********************************************
******************************************************************************************/


#define HIB_HIBDATA0            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA0_OFFSET )))
#define HIB_HIBDATA0_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA0_OFFSET)))
#define HIB_BITBANDING_HIBDATA0      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA0_OFFSET)*32u))))

#define HIB_HIBDATA1            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA1_OFFSET )))
#define HIB_HIBDATA1_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA1_OFFSET)))
#define HIB_BITBANDING_HIBDATA1      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA1_OFFSET)*32u))))

#define HIB_HIBDATA2            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA2_OFFSET )))
#define HIB_HIBDATA2_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA2_OFFSET)))
#define HIB_BITBANDING_HIBDATA2      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA2_OFFSET)*32u))))

#define HIB_HIBDATA3            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA3_OFFSET )))
#define HIB_HIBDATA3_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA3_OFFSET)))
#define HIB_BITBANDING_HIBDATA3      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA3_OFFSET)*32u))))

#define HIB_HIBDATA4            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA4_OFFSET )))
#define HIB_HIBDATA4_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA4_OFFSET)))
#define HIB_BITBANDING_HIBDATA4      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA4_OFFSET)*32u))))

#define HIB_HIBDATA5            (((HIBDATA_TypeDef*)(HIB_BASE+HIB_HIBDATA5_OFFSET )))
#define HIB_HIBDATA5_R          (*((volatile uint32_t *)(HIB_BASE+HIB_HIBDATA5_OFFSET)))
#define HIB_BITBANDING_HIBDATA5      (((BITBANDING_HIBDATA_TypeDef*)(HIB_BITBANDING_BASE+((HIB_OFFSET+HIB_HIBDATA5_OFFSET)*32u))))

